/*
用while语句求1+2+3+4…+100的和。
*/
#include <stdio.h>
int main()
{
//***********************while***************************
//  int i=1,sum=0;           // 循环初始化 
//  while(i<=100) //i=1 2 3 4 5 6        // 设置循环控制条件
//  { 
//  //执行循环体
//   sum=sum+i;//sum=0+1;sum=1+2;sum=1+2+3;sum=1+2+3+4;sum=1+2+3+4+5=15                   
//   i++; //i=2 3 4 5 6                       
//  }                               
//  printf("sum=%d\n",sum);  //输出累加和   
//*********************do...while******************************* 
//	int i=1,sum=0;           // 循环初始化 
//  	do //i=1 2 3 4 5 ...100       
//  	{ 
//  		//执行循环体
//   		sum=sum+i;//sum=0+1;sum=1+2;sum=1+2+3;sum=1+2+3+4;sum=1+2+3+4+5=15                   
//   		i++; //i=2 3 4 5...101                        
//  	}while(i<=100);// 设置循环控制条件                              
//  	printf("sum=%d\n",sum);
//**********************for******************************
	int sum=0;           
	//表达式1初始执行一次；
	//表达式2设置循环控制条件，执行多次
	//表达式3执行多次 
  	for(int i=1;i<=100;i++) //i=1 2 3 4 5 ...100       
  	{ 
  		//执行循环体
   		sum=sum+i;//sum=0+1;sum=1+2;sum=1+2+3;sum=1+2+3+4;sum=1+2+3+4+5=15                                         
	}                              
  	printf("sum=%d\n",sum); 
	return 0;
}
